[
    {
      "englishSentence": "I have been reading a book for hours.",
      "hindiMeaning": "मैंने घंटों से एक किताब पढ़ रहा हूँ।"
    },
    {
      "englishSentence": "She has been working at the company since last year.",
      "hindiMeaning": "वह पिछले साल से कंपनी में काम कर रही है।"
    },
    {
      "englishSentence": "They have been studying Spanish.",
      "hindiMeaning": "वे स्पैनिश पढ़ रहे हैं।"
    },
    {
      "englishSentence": "He has been playing the piano all evening.",
      "hindiMeaning": "वह शाम से पियानो बजा रहा है।"
    },
    {
      "englishSentence": "She has been gardening in her backyard.",
      "hindiMeaning": "वह अपने पिछवाड़े में बागवानी कर रही है।"
    },
    {
      "englishSentence": "I have been cooking dinner for the family.",
      "hindiMeaning": "मैंने परिवार के लिए रात का खाना पका रहा हूँ।"
    },
    {
      "englishSentence": "They have been watching movies all weekend.",
      "hindiMeaning": "वे पूरे वीकएंड से फिल्में देख रहे हैं।"
    },
    {
      "englishSentence": "He has been repairing his car for days.",
      "hindiMeaning": "वह दिनों से अपनी कार की मरम्मत कर रहा है।"
    },
    {
      "englishSentence": "She has been studying English grammar for a while now.",
      "hindiMeaning": "वह कुछ समय से अब तक अंग्रेज़ी व्याकरण पढ़ रही है।"
    },
    {
      "englishSentence": "They have been building a new house for months.",
      "hindiMeaning": "वे महीनों से एक नया घर बना रहे हैं।"
    },
    {
      "englishSentence": "I have been waiting for you since morning.",
      "hindiMeaning": "मैं सुबह से तुम्हारा इंतजार कर रहा हूँ।"
    },
    {
      "englishSentence": "She has been practicing yoga regularly.",
      "hindiMeaning": "वह नियमित रूप से योग का अभ्यास कर रही है।"
    },
    {
      "englishSentence": "He has been attending meetings all week.",
      "hindiMeaning": "वह पूरे हफ्ते से मीटिंगों में भाग रहा है।"
    },
    {
      "englishSentence": "They have been walking in the park for hours.",
      "hindiMeaning": "वे घंटों से पार्क में चल रहे हैं।"
    },
    {
      "englishSentence": "I have been learning to dance for months.",
      "hindiMeaning": "मैंने महीनों से नृत्य सीख रहा हूँ।"
    },
    {
      "englishSentence": "She has been helping her neighbors with gardening.",
      "hindiMeaning": "वह अपने पड़ोसियों की बागवानी में मदद कर रही है।"
    },
    {
      "englishSentence": "They have been cleaning the house all day.",
      "hindiMeaning": "वे पूरे दिन घर की सफाई कर रहे हैं।"
    },
    {
      "englishSentence": "He has been reading newspapers since morning.",
      "hindiMeaning": "वह सुबह से अख़बार पढ़ रहा है।"
    },
    {
      "englishSentence": "She has been jogging in the park for an hour.",
      "hindiMeaning": "वह पार्क में एक घंटे से जॉगिंग कर रही है।"
    },
    {
      "englishSentence": "They have been painting the walls of their house.",
      "hindiMeaning": "वे अपने घर की दीवारों को रंगने में लगे हुए हैं।"
    },
    {
      "englishSentence": "I have been working on this project for weeks.",
      "hindiMeaning": "मैंने हफ्तों से इस प्रोजेक्ट पर काम किया है।"
    },
    {
      "englishSentence": "She has been babysitting her niece all day.",
      "hindiMeaning": "वह पूरे दिन अपनी भतीजी की देखभाल कर रही है।"
    },
    {
      "englishSentence": "He has been teaching math to high school students.",
      "hindiMeaning": "वह हाई स्कूल के छात्रों को गणित सिखा रहे हैं।"
    },
    {
      "englishSentence": "They have been playing chess for hours.",
      "hindiMeaning": "वे घंटों से शतरंज खेल रहे हैं।"
    },
    {
      "englishSentence": "I have been volunteering at the local shelter for a year.",
      "hindiMeaning": "मैंने एक साल से स्थानीय शरणालय में स्वयंसेवा किया है।"
    },
    {
      "englishSentence": "She has been practicing the violin for a long time.",
      "hindiMeaning": "वह बहुत समय से वायलिन का अभ्यास कर रही है।"
    },
    {
      "englishSentence": "They have been renovating their old house for months.",
      "hindiMeaning": "वे महीनों से अपने पुराने घर की नवीनीकरण कर रहे हैं।"
    },
    {
      "englishSentence": "I have been writing a novel for a while now.",
      "hindiMeaning": "मैंने कुछ समय से अब तक एक उपन्यास लिख रहा हूँ।"
    },
    {
      "englishSentence": "She has been working out at the gym regularly.",
      "hindiMeaning": "वह नियमित रूप से जिम में व्यायाम कर रही है।"
    },
    {
      "englishSentence": "He has been coaching a youth soccer team.",
      "hindiMeaning": "वह एक युवा सॉकर टीम को कोच कर रहे हैं।"
    },
    {
      "englishSentence": "They have been studying for their final exams all week.",
      "hindiMeaning": "वे पूरे हफ्ते से अपनी अंतिम परीक्षाओं के लिए पढ़ रहे हैं।"
    },
    {
      "englishSentence": "I have been meditating for an hour every morning.",
      "hindiMeaning": "मैंने हर सुबह एक घंटे के लिए ध्यान किया है।"
    },
    {
      "englishSentence": "She has been writing poetry since she was a child.",
      "hindiMeaning": "वह बचपन से ही कविता लिख रही है।"
    },
    {
      "englishSentence": "They have been running a successful business for years.",
      "hindiMeaning": "वे सालों से एक सफल व्यवसाय चला रहे हैं।"
    },
    {
      "englishSentence": "I have been exploring different cuisines lately.",
      "hindiMeaning": "मैंने हाल ही में विभिन्न खानों की खोज की है।"
    },
    {
      "englishSentence": "She has been taking care of her sick grandmother.",
      "hindiMeaning": "वह अपनी बीमार दादी की देखभाल कर रही है।"
    },
    {
      "englishSentence": "They have been developing a new software application.",
      "hindiMeaning": "वे एक नई सॉफ़्टवेयर एप्लिकेशन विकसित कर रहे हैं।"
    },
    {
      "englishSentence": "I have been fishing by the lake all day.",
      "hindiMeaning": "मैंने पूरे दिन झील के किनारे में मछली पकड़ी है।"
    },
    {
      "englishSentence": "She has been volunteering at the local animal shelter for months.",
      "hindiMeaning": "वह महीनों से स्थानीय पशु आश्रय में स्वयंसेवा कर रही है।"
    },
    {
      "englishSentence": "They have been designing websites for various clients.",
      "hindiMeaning": "वे विभिन्न ग्राहकों के लिए वेबसाइट डिज़ाइन कर रहे हैं।"
    },
    {
      "englishSentence": "I have been taking care of my plants all week.",
      "hindiMeaning": "मैंने पूरे हफ्ते अपने पौधों की देखभाल की है।"
    }
  ]
  